benchmarks/tutorial-based/v2006/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

72
(
    frontAndBack
    {
        type            patch;
        nFaces          360;
        startFace       1058665;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       1059025;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       1059097;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5373;
        startFace       1059169;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       1064542;
    }
    motorBike_frt-fairing:001%1
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          5274;
        startFace       1064702;
    }
    motorBike_windshield:002%2
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          51;
        startFace       1069976;
    }
    motorBike_rr-wh-rim:005%5
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          119;
        startFace       1070027;
    }
    motorBike_rr-wh-rim:010%10
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          353;
        startFace       1070146;
    }
    motorBike_fr-wh-rim:011%11
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          497;
        startFace       1070499;
    }
    motorBike_fr-wh-brake-disk:012%12
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          45;
        startFace       1070996;
    }
    motorBike_frame:016-shadow%13
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          107;
        startFace       1071041;
    }
    motorBike_rear-susp:014%14
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          801;
        startFace       1071148;
    }
    motorBike_rear-susp:014-shadow%15
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          471;
        startFace       1071949;
    }
    motorBike_frame:016%16
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          58;
        startFace       1072420;
    }
    motorBike_rr-wh-rim:005-shadow%17
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          68;
        startFace       1072478;
    }
    motorBike_rr-wh-chain-hub:022%22
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          126;
        startFace       1072546;
    }
    motorBike_rearseat%24
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          421;
        startFace       1072672;
    }
    motorBike_frt-fairing%25
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          618;
        startFace       1073093;
    }
    motorBike_windshield%26
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          370;
        startFace       1073711;
    }
    motorBike_headlights%27
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          156;
        startFace       1074081;
    }
    motorBike_driversseat%28
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          351;
        startFace       1074237;
    }
    motorBike_rear-body%29
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2053;
        startFace       1074588;
    }
    motorBike_fuel-tank%30
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          876;
        startFace       1076641;
    }
    motorBike_exhaust%31
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2336;
        startFace       1077517;
    }
    motorBike_rr-wh-rim%32
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1378;
        startFace       1079853;
    }
    motorBike_fr-mud-guard%33
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          604;
        startFace       1081231;
    }
    motorBike_fr-wh-rim%34
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          572;
        startFace       1081835;
    }
    motorBike_fr-wh-brake-disk%35
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          437;
        startFace       1082407;
    }
    motorBike_fr-brake-caliper%36
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          159;
        startFace       1082844;
    }
    motorBike_fr-wh-tyre%37
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1101;
        startFace       1083003;
    }
    motorBike_hbars%38
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          519;
        startFace       1084104;
    }
    motorBike_fr-forks%39
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1096;
        startFace       1084623;
    }
    motorBike_chain%40
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          456;
        startFace       1085719;
    }
    motorBike_rr-wh-tyre%41
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1845;
        startFace       1086175;
    }
    motorBike_square-dial%42
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          6;
        startFace       1088020;
    }
    motorBike_round-dial%43
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          15;
        startFace       1088026;
    }
    motorBike_dial-holder%44
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          86;
        startFace       1088041;
    }
    motorBike_rear-susp%45
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1732;
        startFace       1088127;
    }
    motorBike_rear-brake-lights%46
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          54;
        startFace       1089859;
    }
    motorBike_rear-light-bracket%47
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          158;
        startFace       1089913;
    }
    motorBike_frame%48
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2008;
        startFace       1090071;
    }
    motorBike_rear-mud-guard%49
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          663;
        startFace       1092079;
    }
    motorBike_rear-susp-spring-damp%50
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          100;
        startFace       1092742;
    }
    motorBike_fairing-inner-plate%51
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          435;
        startFace       1092842;
    }
    motorBike_clutch-housing%52
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          925;
        startFace       1093277;
    }
    motorBike_radiator%53
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          53;
        startFace       1094202;
    }
    motorBike_water-pipe%54
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          101;
        startFace       1094255;
    }
    motorBike_water-pump%55
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          71;
        startFace       1094356;
    }
    motorBike_engine%56
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2299;
        startFace       1094427;
    }
    motorBike_rear-shock-link%57
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          22;
        startFace       1096726;
    }
    motorBike_rear-brake-fluid-pot-bracket%58
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          43;
        startFace       1096748;
    }
    motorBike_rear-brake-fluid-pot%59
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          53;
        startFace       1096791;
    }
    motorBike_footpeg%60
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          90;
        startFace       1096844;
    }
    motorBike_rr-wh-chain-hub%61
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          129;
        startFace       1096934;
    }
    motorBike_rear-brake-caliper%62
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          144;
        startFace       1097063;
    }
    motorBike_rider-helmet%65
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          762;
        startFace       1097207;
    }
    motorBike_rider-visor%66
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          165;
        startFace       1097969;
    }
    motorBike_rider-boots%67
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1008;
        startFace       1098134;
    }
    motorBike_rider-gloves%68
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          310;
        startFace       1099142;
    }
    motorBike_rider-body%69
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          4586;
        startFace       1099452;
    }
    motorBike_frame:0%70
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          36;
        startFace       1104038;
    }
    motorBike_frt-fairing:001-shadow%74
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          3333;
        startFace       1104074;
    }
    motorBike_windshield-shadow%75
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          258;
        startFace       1107407;
    }
    motorBike_fr-mud-guard-shadow%81
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          362;
        startFace       1107665;
    }
    motorBike_fr-wh-brake-disk-shadow%83
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          199;
        startFace       1108027;
    }
    motorBike_rear-mud-guard-shadow%84
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          393;
        startFace       1108226;
    }
    motorBike_rear-susp-spring-damp-shadow%85
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          40;
        startFace       1108619;
    }
    motorBike_radiator-shadow%86
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          19;
        startFace       1108659;
    }
    motorBike_rear-shock-link-shadow%87
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          14;
        startFace       1108678;
    }
    motorBike_rear-brake-fluid-pot-bracket-shadow%88
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          23;
        startFace       1108692;
    }
    motorBike_rr-wh-chain-hub-shadow%89
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          63;
        startFace       1108715;
    }
)

// ************************************************************************* //
